Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/the_irish_government/coalition_government.html.txt.tmx
Source language: en
Languages: ga

source: After a general election, the party with the support of the majority of the members in the Dáil will secure the nomination of Taoiseach who will then set up a government
ga: In ndiaidh olltoghcháin, tá an deis ag an bpáirtí, ag a bhfuil tacaíocht tromlach baill na Dála, an Taoiseach a ainmniú agus ansin Rialtas a bhunú

source: If, after a general election, no party can get the support of the majority of the members of the Dáil, 2 or more parties may agree to work together as a coalition government
ga: Má tharlaíonn sé, tar éis an olltoghcháin, nach bhfuil aon pháirtí amháin le tacaíocht ón tromlach is féidir le 2 pháirtí nó níos mó aontú ar oibriú le chéile chun an tír a rialú mar chomhrialtas

source: The coalition parties will agree on who will be nominated as Taoiseach
ga: Beidh ar na páirtithe aontú ar an té a bheidh mar Thaoiseach orthu

source: Usually, it is the leader of the larger party
ga: De ghnáth, is é/í ceannaire an pháirtí is mó a roghnaítear

source: In recent years, the practice has been to nominate the leader of the smaller party as Tánaiste
ga: Le blianta beaga anuas roghnaítear ceannaire an pháirtí is lú mar Thánaiste

source: The ministerial portfolios will then be shared between the parties
ga: Roinntear cúram na n-airí ansin ar an dá nó trí pháirtí

source: Usually the larger party will be given a greater number of portfolios
ga: Tugtar, de ghnáth, níos nó díobh don pháirtí is mó

source: The leader of each party will decide which elected members of the party to allocate those portfolios to
ga: Is iad ceannairí na bpáirtithe a shocraíonn cé dó/dí a thugtar na postanna mar airí i measc na mball tofa

source: The coalition government will remain in power for as long as it keeps the support of the majority of the Dáil
ga: Bíonn an comhrialtas i gcumhacht an fhad agus a fhaigheann said tacaíocht ó thromlach na dTeachtaí Dála sa Dáil

source: If the coalition parties find that for some reason they cannot agree and can no longer work together, the Taoiseach may advise the President to dissolve the Dáil
ga: Má tharlaíonn sé go bhfuil fáth éigin nach bhfuil na páirtithe éagsúla sa chomhrialtas ag aontú ar chúis éigin is féidir leis an Taoiseach dul chuig an Uachtarán agus iarraidh air/uirthi an Dáil a lánscoir
